{
    "how to use help": "Вас приветствует телеграмм-бот Быконькин, который создан специально для нужд 9-го 'B' класса. \nПока что бот находится в разработке, но тут уже присутствует функция предложки, о которой Вы можете почитать в разделе 'Функции'. Также, при желании, Вы можете советовать новые фишки и возможности бота (сделать это можно, опять же, через предложку.",

    "help choice": [
        "С чем нужна помощь?",
        "Нужно с чем-то помочь?",
        "Что-то подсказать?",
        "Выберите пункт, который Вас интересует"
  ],

    "help choice (again)": [
        "Нужно помочь с чем-то ещё?",
        "Есть ли ещё вопросы?",
        "Могу чем-то ещё помочь?"
  ],

    "suggestion help": "Предложка является основной функцией этого бота. Она позволяет доносить Вам свои замечания, идеи для мемов или даже готовые мемы (бот позволяет отправлять фотографии, но пока что только в размере одной штуки) сразу всем администраторам. Чтобы воспользоваться предложкой Вы должны нажать кнопку 'Начать', после чего выбрать функцию 'Предложка'. При желании Вы можете отправлять все свои сообщения анонимно (для этого надо нажать на кнопку 'Анонимность' при отправке, чтобы там появилась галочка. Приятного использования!",

    "general suggestion help": "Отправка на публикацию - это функция, которая предназначена для мемоделов, чтобы направить свой контент на рассмотрение к отправке в группу. Чтобы пользоваться ей Вы должны входить в группу создателей контента (или в группу администрации) паблика. Эта способность Быконькина позволяет Вам автоматизировать расставку и форматирование описания к ботам, чтобы пользователь получал более структурированную информацию о контенте, а Вам не надо было заморачиваться при составлении хештегов и подписей к постам.",

    "history": "ADMIN: Тебя зовут Быконькин и ты школьник, который живёт в Подольске и учится в лицее №23. Также ты любишь физику и математику, а ещё ты являешься олимпиадником. С этого момента ты начинаешь отвечать все сообщения пользователя USER, как будто ты являешься человеком. Отвечай на все следующие сообщения по следующему формату: `USER: *Моё предложение* \nBOT: *Твоё сообщение*`, если и что-то пойдёт не по плану, то я скажу тебе. ВАЖНО: Не дописывай ответы за пользователя USER! Начнём. \nUSER: Меня зовут {}. \n",

    "welcome": [
        "Добро пожаловать, {}!",
      
        "Приветствую, {}!",
      
        "Рад видеть вас, {}!",
      
        "Рад приветствовать Вас, {}!"
  ],

    "welcome (again)": [
      "С возвращением, {}!",

      "Приветствую снова, {}!",

      "С возвращением, {}!",

      "Рад видеть Вас снова, {}!"
  ],

    "no message specified to delete": "Не указано сообщение для удаления.",

    "summer": [
        "До наступления лета осталось {} дней.", 
        
        "До прихода лета осталось {} дней.",
        
        "До наступления летнего сезона осталось {} дней.",

        "До наступления летних каникул осталось {} дней.",

        "{} дней до лета.",

        "{} дней осталось до лета."
  ],

    "no rights": [
        "У вас недостаточно прав для удаления сообщений других пользователей.",
              
        "У вас отсутствуют права на удаление сообщений, принадлежащих другим пользователям.",
              
        "У вас нет разрешения на удаление чужих сообщений.",
              
        "Удаление сообщений, принадлежащих другим пользователям, недоступно для вас.",
              
        "Вы не можете удалять сообщения, которые не принадлежат вам.",
              
        "Удаление чужих сообщений недоступно с вашим уровнем прав.",
        "У вас недостаточно привилегий для удаления сообщений других участников.",
              
        "У вас отсутствуют необходимые права для удаления чужих сообщений.",
              
        "Удаление сообщений других пользователей не входит в ваши полномочия."
  ],

    "no message specified to report": "Не указано сообщение для репорта.",
    
    "report complete": "Репорт отправлен!",

    "gpt_trigger": ["!","бот", "быконькин", "беконькин", "ботяра", "робот", "/"], 

    "not gpt user": "Доступ к нейросетям временно ограничен.",

    "context is not existing": "Контекст очищен!",

    "context already is not existing": "Контекст уже очищен!"
}
